Repository: KiYouJyo/UCAD
Catalog: src/UCAD.App/Strings/*/UcadV039.resw
Source language: en_us
Languages: ja_jp, zh_cn

# Start_TabTitle
source: Start
ja_jp: スタート
zh_cn: 开始

# Settings_TabTitle
source: Settings
ja_jp: 設定
zh_cn: 设置

# Common_Close
source: Close
ja_jp: 閉じる
zh_cn: 关闭

# Feature_Files_Title
source: Open Drawing
ja_jp: 図面を開く
zh_cn: 打开图纸

# Feature_Files_Message
source: File open/save will be connected by the future file layer. This release keeps the entry point without pretending unsupported file I/O exists.
ja_jp: ファイルの開閉・保存は今後のファイル層で実装します。本バージョンでは入口のみを用意し、未実装の機能は偽装しません。
zh_cn: 文件打开与保存将在后续文件层接入。本版本保留入口，但不会伪造尚未实现的文件能力。

# Feature_Updates_Title
source: Check for updates
ja_jp: 更新を確認
zh_cn: 检查更新

# Feature_Updates_Message
source: The update service is not connected in v0.3.9 yet. This page keeps a stable entry point.
ja_jp: 更新サービスは v0.3.9 では未接続です。このページには安定した入口のみを用意しています。
zh_cn: 更新服务尚未接入 v0.3.9。本页已保留稳定入口。

# Feature_Learn_Title
source: Learn UCAD
ja_jp: UCAD を学ぶ
zh_cn: 学习 UCAD

# Feature_Learn_Message
source: This learning content will be connected to the future documentation system. No fake tutorial flow is shown.
ja_jp: この学習コンテンツは今後のドキュメント体系で提供します。現在は未実装のチュートリアルを偽装しません。
zh_cn: 该学习内容将在后续文档体系接入。当前不会打开虚假的教程流程。

# Start_Title.Text
source: Start with UCAD
ja_jp: UCAD を始める
zh_cn: 开始使用 UCAD

# Start_Subtitle.Text
source: Create or open a drawing, continue recent work, or start from a template.
ja_jp: 新しい図面を作成・開く、最近の作業を続ける、またはテンプレートから始めます。
zh_cn: 新建或打开图纸，继续最近的工作，或从模板开始。

# Start_NewDrawing_Title.Text
source: New Drawing
ja_jp: 新規図面
zh_cn: 新建图纸

# Start_NewDrawing_Description.Text
source: Create a blank 2D CAD drawing
ja_jp: 空の 2D CAD 図面を作成します
zh_cn: 创建一个空白二维 CAD 图纸

# Start_OpenDrawing_Title.Text
source: Open Drawing
ja_jp: 図面を開く
zh_cn: 打开图纸

# Start_OpenDrawing_Description.Text
source: Open an existing drawing from a file
ja_jp: ファイルから既存の図面を開きます
zh_cn: 从文件打开现有图纸

# Start_Recent_Title.Text
source: Recent
ja_jp: 最近使用したファイル
zh_cn: 最近使用

# Start_Recent_ShowAll.Content
source: Show all
ja_jp: すべて表示
zh_cn: 显示全部

# Start_Recent_EmptyTitle.Text
source: No recent drawings yet
ja_jp: 最近使用した図面はありません
zh_cn: 还没有最近使用的图纸

# Start_Recent_EmptyDescription.Text
source: Opened or saved drawings will appear here.
ja_jp: 図面を開くか保存すると、ここに表示されます。
zh_cn: 打开或保存图纸后，它们会显示在这里。

# Start_Templates_Title.Text
source: Templates
ja_jp: テンプレート
zh_cn: 模板

# Start_Template_Blank_Title.Text
source: Blank
ja_jp: 空白
zh_cn: 空白

# Start_Template_Blank_Description.Text
source: Standard blank drawing
ja_jp: 標準の空白図面
zh_cn: 标准空白图纸

# Start_Template_Architecture_Title.Text
source: Architecture
ja_jp: 建築設計
zh_cn: 建筑设计

# Start_Template_Architecture_Description.Text
source: Architectural drafting preset
ja_jp: 建築作図プリセット
zh_cn: 建筑绘图预设

# Start_Template_Urban_Title.Text
source: Urban Planning
ja_jp: 都市計画
zh_cn: 城市规划

# Start_Template_Urban_Description.Text
source: Planning drafting preset
ja_jp: 都市計画作図プリセット
zh_cn: 规划绘图预设

# Common_ComingSoon.Text
source: Coming Soon
ja_jp: 近日対応
zh_cn: 即将推出

# Start_Learn_Title.Text
source: Learn UCAD
ja_jp: UCAD を学ぶ
zh_cn: 学习 UCAD

# Start_Learn_Shortcuts.Text
source: Shortcuts
ja_jp: ショートカット
zh_cn: 快捷键

# Start_Learn_BasicDrawing.Text
source: Basic Drawing
ja_jp: 基本作図
zh_cn: 基本绘图

# Start_Learn_Commands.Text
source: Commands & Aliases
ja_jp: コマンドとエイリアス
zh_cn: 命令与别名

# Start_Learn_Docs.Text
source: View Documentation
ja_jp: ドキュメントを見る
zh_cn: 查看文档

# Settings_Nav_Title
source: Settings
ja_jp: 設定
zh_cn: 设置

# Settings_Nav_General
source: General
ja_jp: 一般
zh_cn: 常规

# Settings_Nav_Appearance
source: Appearance
ja_jp: 外観
zh_cn: 外观

# Settings_Nav_Drafting
source: Drafting
ja_jp: 作図
zh_cn: 绘图

# Settings_Nav_Input
source: Input & Interaction
ja_jp: 入力と操作
zh_cn: 输入与交互

# Settings_Nav_Files
source: Files & Save
ja_jp: ファイルと保存
zh_cn: 文件与保存

# Settings_Nav_Language
source: Language & Region
ja_jp: 言語と地域
zh_cn: 语言与区域

# Settings_Nav_About
source: About UCAD
ja_jp: UCAD について
zh_cn: 关于 UCAD

# Settings_Option_StartPage
source: Show Start page
ja_jp: スタートページを表示
zh_cn: 显示开始页

# Settings_Option_BlankDrawing
source: Create blank drawing
ja_jp: 空白図面を新規作成
zh_cn: 新建空白图纸

# Settings_Option_RestoreSession
source: Restore last session
ja_jp: 前回のセッションを復元
zh_cn: 恢复上次会话

# Settings_Option_System
source: System
ja_jp: システムに従う
zh_cn: 跟随系统

# Settings_Option_Dark
source: Dark
ja_jp: ダーク
zh_cn: 深色

# Settings_Option_Light
source: Light
ja_jp: ライト
zh_cn: 浅色

# Settings_Option_CanvasBlack
source: Black · #0E1012
ja_jp: ブラック · #0E1012
zh_cn: 黑色 · #0E1012

# Settings_Option_CanvasGraphite
source: Graphite · #18181A
ja_jp: グラファイト · #18181A
zh_cn: 石墨 · #18181A

# Settings_Option_CanvasWhite
source: White · #FFFFFF
ja_jp: ホワイト · #FFFFFF
zh_cn: 白色 · #FFFFFF

# Settings_Option_Millimeters
source: Millimeters
ja_jp: ミリメートル
zh_cn: 毫米

# Settings_Option_Meters
source: Meters
ja_jp: メートル
zh_cn: 米

# Settings_Option_Inches
source: Inches
ja_jp: インチ
zh_cn: 英寸

# Settings_Option_DecimalDegrees
source: Decimal degrees
ja_jp: 十進角度
zh_cn: 十进制度

# Settings_Option_Radians
source: Radians
ja_jp: ラジアン
zh_cn: 弧度

# Settings_Option_SnapCore
source: Endpoint / Midpoint / Intersection
ja_jp: 端点 / 中点 / 交点
zh_cn: 端点 / 中点 / 交点

# Settings_Option_SnapBasic
source: Endpoint / Midpoint
ja_jp: 端点 / 中点
zh_cn: 端点 / 中点

# Settings_Option_CadStandard
source: Standard Window / Crossing
ja_jp: 標準 Window / Crossing
zh_cn: 标准 Window / Crossing

# Settings_Option_Minutes5
source: 5 minutes
ja_jp: 5 分
zh_cn: 5 分钟

# Settings_Option_Minutes10
source: 10 minutes
ja_jp: 10 分
zh_cn: 10 分钟

# Settings_Option_Minutes15
source: 15 minutes
ja_jp: 15 分
zh_cn: 15 分钟

# Settings_Option_Minutes30
source: 30 minutes
ja_jp: 30 分
zh_cn: 30 分钟

# Settings_Option_SystemLanguage
source: System language
ja_jp: システム言語
zh_cn: 系统语言

# Settings_Option_Chinese
source: Simplified Chinese
ja_jp: 簡体字中国語
zh_cn: 简体中文

# Settings_Option_Japanese
source: Japanese
ja_jp: 日本語
zh_cn: 日本語

# Settings_Option_SystemRegion
source: System regional format
ja_jp: システムの地域形式
zh_cn: 系统区域格式

# Settings_Option_InvariantRegion
source: Invariant format
ja_jp: 固定形式
zh_cn: 固定格式

# Settings_Option_Metric
source: Metric
ja_jp: メートル法
zh_cn: 公制

# Settings_Option_Imperial
source: Imperial
ja_jp: ヤード・ポンド法
zh_cn: 英制

# Settings_Option_Automatic
source: Automatic
ja_jp: 自動
zh_cn: 自动

# Settings_Option_DecimalDot
source: Decimal point (.)
ja_jp: 小数点（.）
zh_cn: 小数点（.）

# Settings_Option_DecimalComma
source: Decimal comma (,)
ja_jp: 小数カンマ（,）
zh_cn: 小数逗号（,）

# Settings_Action_CheckNow
source: Check now
ja_jp: 今すぐ確認
zh_cn: 检查更新

# Settings_Action_Clear
source: Clear
ja_jp: 消去
zh_cn: 清除

# Settings_Action_Open
source: Open
ja_jp: 開く
zh_cn: 打开

# Settings_Action_View
source: View
ja_jp: 表示
zh_cn: 查看

# Settings_General_Title
source: General
ja_jp: 一般
zh_cn: 常规

# Settings_General_Subtitle
source: Configure UCAD startup, tab behavior, and update preferences.
ja_jp: UCAD の起動方法、タブ動作、更新設定を調整します。
zh_cn: 设置 UCAD 的启动方式、标签页行为与更新偏好。

# Settings_General_StartupSection
source: Startup & Session
ja_jp: 起動とセッション
zh_cn: 启动与会话

# Settings_General_StartupBehavior_Title
source: When UCAD starts
ja_jp: UCAD 起動時
zh_cn: 启动 UCAD 时

# Settings_General_StartupBehavior_Description
source: Choose what is shown first after launch.
ja_jp: 起動後に最初に表示する内容を選択します。
zh_cn: 选择启动后首先显示的内容。

# Settings_General_NewTab_Title
source: Show Start page in new tabs
ja_jp: 新しいタブでスタートページを表示
zh_cn: 新标签页显示开始页

# Settings_General_NewTab_Description
source: Open Start when the title-bar + button is used instead of creating a drawing.
ja_jp: タイトルバーの + で図面を直接作らず Start を開きます。
zh_cn: 点击标题栏 + 时进入 Start，而不是直接创建图纸。

# Settings_General_CloseUnsaved_Title
source: Confirm before closing unsaved drawings
ja_jp: 未保存図面を閉じる前に確認
zh_cn: 关闭未保存图纸前确认

# Settings_General_CloseUnsaved_Description
source: Ask for confirmation before closing a drawing with unsaved content.
ja_jp: 未保存内容を含む図面を閉じる前に確認します。
zh_cn: 关闭包含未保存内容的图纸时显示确认。

# Settings_General_UpdatesSection
source: Updates
ja_jp: 更新
zh_cn: 更新

# Settings_General_AutoUpdate_Title
source: Automatically check for updates
ja_jp: 更新を自動確認
zh_cn: 自动检查更新

# Settings_General_AutoUpdate_Description
source: Check for available updates automatically after UCAD starts.
ja_jp: UCAD 起動後に利用可能な更新を自動確認します。
zh_cn: 启动 UCAD 后自动检查可用更新。

# Settings_General_CheckUpdate_Title
source: Check for updates
ja_jp: 更新を確認
zh_cn: 检查更新

# Settings_General_CheckUpdate_Description
source: Manually check for the latest UCAD version.
ja_jp: UCAD の最新バージョンを手動で確認します。
zh_cn: 手动检查 UCAD 的最新版本。

# Settings_Appearance_Title
source: Appearance
ja_jp: 外観
zh_cn: 外观

# Settings_Appearance_Subtitle
source: Configure the app UI and CAD canvas appearance independently.
ja_jp: アプリ UI と CAD キャンバスの外観を個別に設定します。
zh_cn: 分别设置应用界面与 CAD 画布的视觉主题。

# Settings_Appearance_ThemeSection
source: Theme
ja_jp: テーマ
zh_cn: 主题

# Settings_Appearance_AppTheme_Title
source: App Theme
ja_jp: アプリテーマ
zh_cn: 应用主题

# Settings_Appearance_AppTheme_Description
source: Controls the light/dark appearance of UCAD windows and controls.
ja_jp: UCAD のウィンドウとコントロールの明暗を設定します。
zh_cn: 控制 UCAD 界面控件与窗口的明暗外观。

# Settings_Appearance_CanvasTheme_Title
source: Canvas Theme
ja_jp: キャンバステーマ
zh_cn: 画布主题

# Settings_Appearance_CanvasTheme_Description
source: Controls the CAD canvas independently from the app theme.
ja_jp: CAD キャンバスをアプリテーマとは独立して設定します。
zh_cn: 独立控制 CAD 画布，不随应用主题强制变化。

# Settings_Appearance_CanvasBackground_Title
source: Canvas Background
ja_jp: キャンバス背景
zh_cn: 画布背景

# Settings_Appearance_CanvasBackground_Description
source: Choose the CAD workspace background color.
ja_jp: CAD ワークスペースの背景色を選択します。
zh_cn: 选择 CAD 工作区的背景颜色。

# Settings_Appearance_CanvasSection
source: Canvas
ja_jp: キャンバス
zh_cn: 画布

# Settings_Appearance_ShowGrid_Title
source: Show Grid
ja_jp: グリッドを表示
zh_cn: 显示栅格

# Settings_Appearance_ShowGrid_Description
source: Show a reference grid on the CAD canvas.
ja_jp: CAD キャンバスに参照グリッドを表示します。
zh_cn: 在 CAD 画布上显示参考栅格。

# Settings_Appearance_GridOpacity_Title
source: Grid Opacity
ja_jp: グリッド不透明度
zh_cn: 栅格不透明度

# Settings_Appearance_GridOpacity_Description
source: Adjust the visual strength of the reference grid.
ja_jp: 参照グリッドの表示強度を調整します。
zh_cn: 调整参考栅格的视觉强度。

# Settings_Appearance_UiScale_Title
source: UI Scale
ja_jp: UI スケール
zh_cn: 界面缩放

# Settings_Appearance_UiScale_Description
source: Set UCAD UI scale preference; system DPI remains handled by PerMonitorV2.
ja_jp: UCAD UI のスケール設定です。システム DPI は PerMonitorV2 が処理します。
zh_cn: 设置 UCAD 界面的缩放偏好；系统 DPI 仍由 PerMonitorV2 处理。

# Settings_Drafting_Title
source: Drafting
ja_jp: 作図
zh_cn: 绘图

# Settings_Drafting_Subtitle
source: Configure default units, precision, and drafting aids for new drawings.
ja_jp: 新規図面の単位、精度、作図補助の既定値を設定します。
zh_cn: 设置新图纸的单位、精度与绘图辅助默认值。

# Settings_Drafting_DefaultsSection
source: Units & Precision
ja_jp: 単位と精度
zh_cn: 单位与精度

# Settings_Drafting_LengthUnit_Title
source: Length Unit
ja_jp: 長さの単位
zh_cn: 长度单位

# Settings_Drafting_LengthUnit_Description
source: Set the default length unit for new drawings.
ja_jp: 新規図面の既定の長さ単位を設定します。
zh_cn: 设置新图纸使用的默认长度单位。

# Settings_Drafting_Precision_Title
source: Precision
ja_jp: 精度
zh_cn: 精度

# Settings_Drafting_Precision_Description
source: Set the default number of decimal places shown for lengths.
ja_jp: 長さの既定の小数表示桁数を設定します。
zh_cn: 设置长度值默认显示的小数位数。

# Settings_Drafting_AngleUnit_Title
source: Angle Unit
ja_jp: 角度単位
zh_cn: 角度单位

# Settings_Drafting_AngleUnit_Description
source: Set the default unit for angle input and display.
ja_jp: 角度入力・表示の既定単位を設定します。
zh_cn: 设置角度输入与显示的默认单位。

# Settings_Drafting_AidsSection
source: Drafting Aids
ja_jp: 作図補助
zh_cn: 绘图辅助

# Settings_Drafting_ObjectSnap_Title
source: Default Object Snap
ja_jp: 既定のオブジェクトスナップ
zh_cn: 默认对象捕捉

# Settings_Drafting_ObjectSnap_Description
source: Store the default object-snap state for new drawings.
ja_jp: 新規図面のオブジェクトスナップ既定状態を保存します。
zh_cn: 为新图纸保存对象捕捉默认状态。

# Settings_Drafting_SnapTypes_Title
source: Default Snap Types
ja_jp: 既定のスナップ種類
zh_cn: 默认捕捉类型

# Settings_Drafting_SnapTypes_Description
source: Preset endpoint, midpoint, intersection and related snap types.
ja_jp: 端点・中点・交点などの既定値を設定します。
zh_cn: 预设端点、中点、交点等捕捉类型。

# Settings_Drafting_Ortho_Title
source: Default Ortho
ja_jp: 既定の直交
zh_cn: 默认正交

# Settings_Drafting_Ortho_Description
source: Store the default Ortho state for new drawings.
ja_jp: 新規図面の直交モード既定状態を保存します。
zh_cn: 为新图纸保存正交模式默认状态。

# Settings_Drafting_PendingNote
source: Object Snap and Ortho Core are not connected yet. v0.3.9 persists their settings model without faking drafting behavior.
ja_jp: オブジェクトスナップと直交 Core は未接続です。v0.3.9 は設定モデルのみを保存し、作図動作を偽装しません。
zh_cn: 对象捕捉与正交 Core 尚未接入；v0.3.9 仅保存设置模型，不伪造绘图行为。

# Settings_Input_Title
source: Input & Interaction
ja_jp: 入力と操作
zh_cn: 输入与交互

# Settings_Input_Subtitle
source: Adjust mouse, selection, and command-input behavior.
ja_jp: マウス、選択、コマンド入力の操作方法を調整します。
zh_cn: 调整鼠标、选择和命令输入的交互方式。

# Settings_Input_MouseSection
source: Mouse & View
ja_jp: マウスとビュー
zh_cn: 鼠标与视图

# Settings_Input_ZoomCursor_Title
source: Zoom around cursor
ja_jp: カーソル位置を中心にズーム
zh_cn: 以光标为中心缩放

# Settings_Input_ZoomCursor_Description
source: Keep the world point under the cursor stable while zooming.
ja_jp: ホイールズーム時にカーソル位置のワールド座標を維持します。
zh_cn: 滚轮缩放时保持光标所指世界坐标稳定。

# Settings_Input_MiddlePan_Title
source: Middle mouse pan
ja_jp: 中ボタンでパン
zh_cn: 鼠标中键平移

# Settings_Input_MiddlePan_Description
source: Pan the CAD view by dragging with the middle mouse button.
ja_jp: マウス中ボタンを押しながら CAD ビューを移動します。
zh_cn: 按住鼠标中键拖动 CAD 视图。

# Settings_Input_ReverseWheel_Title
source: Reverse wheel zoom
ja_jp: ホイールズームを反転
zh_cn: 反转滚轮缩放

# Settings_Input_ReverseWheel_Description
source: Swap the zoom direction for mouse-wheel up and down.
ja_jp: ホイール上下のズーム方向を入れ替えます。
zh_cn: 交换滚轮向上与向下的缩放方向。

# Settings_Input_SelectionSection
source: Selection
ja_jp: 選択
zh_cn: 选择

# Settings_Input_WindowCrossing_Title
source: Window / Crossing selection
ja_jp: Window / Crossing 選択
zh_cn: Window / Crossing 选择

# Settings_Input_WindowCrossing_Description
source: Use standard CAD directional box-selection semantics.
ja_jp: CAD 標準の方向付きボックス選択を使用します。
zh_cn: 采用 CAD 标准的方向性框选语义。

# Settings_Input_SelectionPreview_Title
source: Selection preview
ja_jp: 選択プレビュー
zh_cn: 选择预览

# Settings_Input_SelectionPreview_Description
source: Preview selectable objects while hovering.
ja_jp: 選択可能なオブジェクトにカーソルを合わせるとプレビューします。
zh_cn: 光标经过可选对象时显示预览状态。

# Settings_Input_CommandSection
source: Command
ja_jp: コマンド
zh_cn: 命令

# Settings_Input_CommandSuggestions_Title
source: Command suggestions
ja_jp: コマンド候補
zh_cn: 命令建议

# Settings_Input_CommandSuggestions_Description
source: Show command-name and alias suggestions while typing.
ja_jp: コマンド入力時に名称とエイリアス候補を表示します。
zh_cn: 输入命令时显示名称与别名建议。

# Settings_Files_Title
source: Files & Save
ja_jp: ファイルと保存
zh_cn: 文件与保存

# Settings_Files_Subtitle
source: Configure auto save, backup, and recent-file behavior.
ja_jp: 自動保存、バックアップ、最近使用した項目を設定します。
zh_cn: 设置自动保存、备份与最近使用记录。

# Settings_Files_AutoSaveSection
source: Auto Save & Backup
ja_jp: 自動保存とバックアップ
zh_cn: 自动保存与备份

# Settings_Files_AutoSave_Title
source: Auto Save
ja_jp: 自動保存
zh_cn: 自动保存

# Settings_Files_AutoSave_Description
source: Store the auto-save preference for the future file layer.
ja_jp: 今後のファイル層向けに自動保存設定を保存します。
zh_cn: 为未来文件层保存自动保存偏好。

# Settings_Files_AutoSaveInterval_Title
source: Auto Save Interval
ja_jp: 自動保存間隔
zh_cn: 自动保存间隔

# Settings_Files_AutoSaveInterval_Description
source: Set the target interval for automatic saving.
ja_jp: 自動保存の目標間隔を設定します。
zh_cn: 设置自动保存的目标时间间隔。

# Settings_Files_Backup_Title
source: Backup on save
ja_jp: 保存時にバックアップを作成
zh_cn: 保存时创建备份

# Settings_Files_Backup_Description
source: Store the backup preference for the future save flow.
ja_jp: 今後の保存処理向けにバックアップ設定を保存します。
zh_cn: 为未来保存流程保留备份偏好。

# Settings_Files_RecentSection
source: Recent Files
ja_jp: 最近使用したファイル
zh_cn: 最近使用

# Settings_Files_ShowRecent_Title
source: Show recent drawings
ja_jp: 最近使用した図面を表示
zh_cn: 显示最近使用的图纸

# Settings_Files_ShowRecent_Description
source: Show the recent list on the Start page.
ja_jp: Start ページに最近使用した項目を表示します。
zh_cn: 在 Start 页面显示最近使用列表。

# Settings_Files_RecentCount_Title
source: Recent file count
ja_jp: 最近のファイル数
zh_cn: 最近文件数量

# Settings_Files_RecentCount_Description
source: Set the future maximum number of items shown on Start.
ja_jp: Start ページに表示する将来の最大件数を設定します。
zh_cn: 设置 Start 页面未来最多显示的条目数。

# Settings_Files_ClearRecent_Title
source: Clear recent history
ja_jp: 最近の履歴を消去
zh_cn: 清除最近记录

# Settings_Files_ClearRecent_Description
source: Clear recent-file history; no fabricated sample files are created.
ja_jp: 最近のファイル履歴を消去します。架空のサンプルファイルは作成しません。
zh_cn: 清除最近文件记录；当前没有伪造的示例文件。

# Settings_Language_Title
source: Language & Region
ja_jp: 言語と地域
zh_cn: 语言与区域

# Settings_Language_Subtitle
source: Configure display language, number format, and unit presentation.
ja_jp: 表示言語、数値形式、単位表示を設定します。
zh_cn: 设置显示语言、数字格式和单位显示偏好。

# Settings_Language_LanguageSection
source: Language
ja_jp: 言語
zh_cn: 语言

# Settings_Language_Display_Title
source: Display Language
ja_jp: 表示言語
zh_cn: 显示语言

# Settings_Language_Display_Description
source: Choose the language used by the UCAD interface.
ja_jp: UCAD UI で使用する言語を選択します。
zh_cn: 选择 UCAD 界面使用的语言。

# Settings_Language_FollowSystem_Title
source: Follow system language
ja_jp: システム言語に従う
zh_cn: 跟随系统语言

# Settings_Language_FollowSystem_Description
source: Allow UCAD to choose the interface language from Windows preferences.
ja_jp: Windows の言語設定に基づいて UCAD の表示言語を選びます。
zh_cn: 允许 UCAD 根据 Windows 语言偏好选择界面语言。

# Settings_Language_RegionalSection
source: Regional Format
ja_jp: 地域形式
zh_cn: 区域格式

# Settings_Language_NumberFormat_Title
source: Number Format
ja_jp: 数値形式
zh_cn: 数字格式

# Settings_Language_NumberFormat_Description
source: Set numeric grouping and regional-format preference.
ja_jp: 数値の区切りと地域形式を設定します。
zh_cn: 设置数字分组和区域格式偏好。

# Settings_Language_UnitDisplay_Title
source: Unit Display
ja_jp: 単位表示
zh_cn: 单位显示

# Settings_Language_UnitDisplay_Description
source: Set the preferred unit system for interface display.
ja_jp: UI に表示する単位系を設定します。
zh_cn: 设置界面中单位体系的显示偏好。

# Settings_Language_AngleDecimal_Title
source: Angle / Decimal format
ja_jp: 角度 / 小数形式
zh_cn: 角度 / 小数格式

# Settings_Language_AngleDecimal_Description
source: Set decimal-separator and angle-value formatting preferences.
ja_jp: 小数区切りと角度値の形式を設定します。
zh_cn: 设置小数分隔符与角度数值的格式偏好。

# Settings_Language_ReloadNote
source: Display-language changes apply fully on the next UCAD launch to avoid mixed-language UI in the current session.
ja_jp: 表示言語の変更は次回の UCAD 起動時に完全適用され、現在のセッションで言語が混在するのを防ぎます。
zh_cn: 更改显示语言将在下次启动 UCAD 时完整应用，避免当前会话出现局部语言混用。

# Settings_About_Title
source: About UCAD
ja_jp: UCAD について
zh_cn: 关于 UCAD

# Settings_About_Subtitle
source: Version, project links, and open-source information.
ja_jp: バージョン、プロジェクトリンク、オープンソース情報。
zh_cn: 版本、项目链接与开源信息。

# Settings_About_AppInfoSection
source: Application
ja_jp: アプリ情報
zh_cn: 应用信息

# Settings_About_AppDescription
source: Lightweight 2D CAD for urban planning and architectural design
ja_jp: 都市計画・建築設計向けの軽量 2D CAD
zh_cn: 面向城市规划与建筑设计的轻量二维 CAD

# Settings_About_Preview
source: Preview
ja_jp: プレビュー
zh_cn: 预览

# Settings_About_ProjectSection
source: Project
ja_jp: プロジェクト
zh_cn: 项目

# Settings_About_GitHub_Title
source: GitHub repository
ja_jp: GitHub リポジトリ
zh_cn: GitHub 仓库

# Settings_About_GitHub_Description
source: View UCAD source code and development history.
ja_jp: UCAD の公開ソースコードと開発履歴を表示します。
zh_cn: 查看 UCAD 的公开源码与开发历史。

# Settings_About_Releases_Description
source: View published versions and installers.
ja_jp: 公開済みバージョンとインストーラーを表示します。
zh_cn: 查看已发布版本与安装包。

# Settings_About_Issue_Title
source: Report an issue
ja_jp: 問題を報告
zh_cn: 报告问题

# Settings_About_Issue_Description
source: Submit a bug report or suggestion in GitHub Issues.
ja_jp: GitHub Issues で不具合や提案を報告します。
zh_cn: 在 GitHub Issues 提交错误或建议。

# Settings_About_OpenSourceSection
source: Open source & Credits
ja_jp: オープンソースとクレジット
zh_cn: 开源与致谢

# Settings_About_OpenSource_Title
source: Open-source information
ja_jp: オープンソース情報
zh_cn: 开源信息

# Settings_About_OpenSource_Description
source: UCAD source, licensing, and third-party dependency information.
ja_jp: UCAD のソース、ライセンス、サードパーティ依存関係。
zh_cn: UCAD 的源码、许可证与第三方依赖信息。

# Settings_About_Credits_Title
source: Credits
ja_jp: クレジット
zh_cn: 致谢

# Settings_About_Credits_Description
source: WinUI 3, Windows App SDK, Win2D, and the open-source community.
ja_jp: WinUI 3、Windows App SDK、Win2D、オープンソースコミュニティ。
zh_cn: WinUI 3、Windows App SDK、Win2D 与开源社区。
